; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-1-4-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-2 - location
	p3-0 - location
	p3-2 - location
	p3-4 - location
	p4-1 - location
	p4-2 - location
	)
	(:init
	(at driver1 s0)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s4)
	(empty truck4)
	(at package1 s4)
	(at package2 s0)
	(at package3 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(link s0 s2)
	(link s2 s0)
	(link s1 s2)
	(link s2 s1)
	(link s1 s3)
	(link s3 s1)
	(link s2 s3)
	(link s3 s2)
	(link s2 s4)
	(link s4 s2)
	(link s4 s0)
	(link s0 s4)
)
	(:goal (and
	(at driver1 s0)
	(at truck1 s3)
	(at truck2 s2)
	(at truck3 s1)
	(at truck4 s0)
	(at package1 s1)
	(at package2 s0)
	(at package3 s0)
	))


)

; plan
1. (walk driver1 s0 p3-0)
   deleted: (at driver1 s0)
   added: (at driver1 p3-0)
   goals met: 2 of 8
2. (walk driver1 p3-0 s3)
   deleted: (at driver1 p3-0)
   added: (at driver1 s3)
   goals met: 2 of 8
3. (walk driver1 s3 p3-4)
   deleted: (at driver1 s3)
   added: (at driver1 p3-4)
   goals met: 2 of 8
4. (walk driver1 p3-4 s4)
   deleted: (at driver1 p3-4)
   added: (at driver1 s4)
   goals met: 2 of 8
5. (board-truck driver1 truck2 s4)
   deleted: (at driver1 s4) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 2 of 8
6. (drive-truck truck2 s4 s2 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   goals met: 3 of 8
7. (disembark-truck driver1 truck2 s2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s2) (empty truck2)
   goals met: 3 of 8
8. (walk driver1 s2 p4-2)
   deleted: (at driver1 s2)
   added: (at driver1 p4-2)
   goals met: 3 of 8
9. (walk driver1 p4-2 s4)
   deleted: (at driver1 p4-2)
   added: (at driver1 s4)
   goals met: 3 of 8
10. (walk driver1 s4 p4-1)
   deleted: (at driver1 s4)
   added: (at driver1 p4-1)
   goals met: 3 of 8
11. (walk driver1 p4-1 s1)
   deleted: (at driver1 p4-1)
   added: (at driver1 s1)
   goals met: 3 of 8
12. (load-truck package1 truck4 s4)
   deleted: (at package1 s4)
   added: (in package1 truck4)
   goals met: 3 of 8
13. (board-truck driver1 truck1 s1)
   deleted: (at driver1 s1) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 3 of 8
14. (drive-truck truck1 s1 s3 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 4 of 8
15. (disembark-truck driver1 truck1 s3)
   deleted: (driving driver1 truck1)
   added: (at driver1 s3) (empty truck1)
   goals met: 4 of 8
16. (walk driver1 s3 p3-4)
   deleted: (at driver1 s3)
   added: (at driver1 p3-4)
   goals met: 4 of 8
17. (walk driver1 p3-4 s4)
   deleted: (at driver1 p3-4)
   added: (at driver1 s4)
   goals met: 4 of 8
18. (board-truck driver1 truck4 s4)
   deleted: (at driver1 s4) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 4 of 8
19. (drive-truck truck4 s4 s2 driver1)
   deleted: (at truck4 s4)
   added: (at truck4 s2)
   goals met: 4 of 8
20. (drive-truck truck4 s2 s1 driver1)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   goals met: 4 of 8
21. (load-truck package3 truck4 s1)
   deleted: (at package3 s1)
   added: (in package3 truck4)
   goals met: 4 of 8
22. (unload-truck package1 truck4 s1)
   deleted: (in package1 truck4)
   added: (at package1 s1)
   goals met: 5 of 8
23. (drive-truck truck4 s1 s2 driver1)
   deleted: (at truck4 s1)
   added: (at truck4 s2)
   goals met: 5 of 8
24. (drive-truck truck4 s2 s0 driver1)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   goals met: 6 of 8
25. (disembark-truck driver1 truck4 s0)
   deleted: (driving driver1 truck4)
   added: (at driver1 s0) (empty truck4)
   goals met: 7 of 8
26. (unload-truck package3 truck4 s0)
   deleted: (in package3 truck4)
   added: (at package3 s0)
   goals met: 8 of 8
